; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=31, out_folder=htg/blocksworld//training, instance_id=11, seed=2035

(define (problem blocksworld-11)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b14)
    (on-table b14)
    (clear b1)
    (on b1 b19)
    (on b19 b24)
    (on b24 b28)
    (on b28 b25)
    (on b25 b13)
    (on b13 b21)
    (on b21 b5)
    (on b5 b18)
    (on-table b18)
    (clear b17)
    (on b17 b29)
    (on-table b29)
    (clear b8)
    (on b8 b9)
    (on b9 b11)
    (on b11 b7)
    (on b7 b31)
    (on b31 b12)
    (on b12 b4)
    (on-table b4)
    (clear b22)
    (on b22 b20)
    (on b20 b30)
    (on b30 b23)
    (on b23 b16)
    (on-table b16)
    (clear b2)
    (on b2 b3)
    (on b3 b6)
    (on b6 b26)
    (on b26 b10)
    (on b10 b27)
    (on-table b27))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b2 b3)
   deleted: (on b2 b3) (clear b2) (arm-empty)
   added: (holding b2) (clear b3)
   goals met: 1 of 4
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 4
3. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 1 of 4
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 4
5. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 2 of 4
6. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
7. (unstack b1 b19)
   deleted: (on b1 b19) (clear b1) (arm-empty)
   added: (holding b1) (clear b19)
   goals met: 2 of 4
8. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
